/*
 * @Author: Sword
 * @Date: 2020-09-12 16:24:10
 * @Description: 以下是在处理业务逻辑中(用来做判断使用),需要用到的玩法id集合
 */
// 滚球和今日里面需要显示比分的玩法
const PLAY_TODAY_SCORE = [
  '4', // 让球盘
  '19', // 半场让球
  '27', // 剩余时间获胜
  '29', // 上半场剩余时间获胜
  // '32', // 15分钟进球-赛果
  '33', // 15分钟进球-让球
  '113', // 角球全场让球
  '121', // 角球上半场让球
  '128', // 加时赛-让球
  '130', // 加时赛-上半场让球
  '143', // 下半场让球盘
  '232', // 15分钟角球让球
  '269', // 全场让球
  '270', // 半场让球
  '306', // 罚牌让分
  '308', // 上半场罚牌比分
  '324', // 黄牌让分
  '327', // 上半场黄牌让分
  '371', // 15分钟玩法罚牌让球
  // '334', // 点球大战-让球
  // '341', // 上半场
  // '342'  // 下半场
];
// 滚球和今日里面需要显示比分的玩法对应的比分键值
const SCORE_BASE_KEY = {
  '4' : 'S1', // 让球盘
  '19': 'S2', // 半场让球
  '27': 'S1', // 剩余时间获胜
  '29': 'S1', // 上半场剩余时间获胜
  // '32': 'S1001', // 15分钟进球-赛果
  // '33': 'S1001',
  //S1001	0~14:59 分钟进球
  //S1002	15~29:59 分钟进球
  //S1003	30~44:59 分钟进球
  //S1004	45~59:59 分钟进球
  //S1005	60~74:59 分钟进球
  //S1006	75~89:59 分钟进球
  '33': "S1001,S1002,S1003,S1004,S1005,S1006",   // 15分钟进球-让球 阶段
  '113': 'S5', // 角球全场让球
  '121': 'S15', // 角球上半场让球
  '128': 'S7', // 加时赛-让球
  '130': 'S701', // 加时赛-上半场让球
  '143': 'S3', // 下半场让球盘
  '232': 'S5001', // 15分钟角球让球
  '269': 'S1', // 全场让球
  '270': 'S2', // 半场让球
  '306': 'S10102', // 罚牌让分
  '308': 'S10103', // 上半场罚牌比分
  '324': "S12001", // 黄牌让分
  '327': 'S14', // 上半场黄牌让分
  '334': 'S170', // 点球大战-让球
}
// 让球玩法
const PLAY_LET_BALL =  [
  '4', // 让球盘
  '19', // 半场让球
  // '32', // 15分钟进球-赛果
  '33', // 15分钟进球-让球
  '39', // 让分
  '46', // 第1节 让分
  '52', // 第2节 让分
  '58', // 第3节 让分
  '64', // 第4节 让分
  '113',// 角球让球盘
  '121', // 半场让球
  '128', // 加时赛上半场
  '130', // 加时赛下半场
  '154', // 让盘
  '155', // 让局
  '163', // 让局
  '172', // 让分
  '176', // 第{X}局让分
  '181', // 让局
  '185', // 第{X}局让分
  '232', // 15分钟角球让球
  '243', // 让球
  '249', // 5局让球
  '253', // 第{X}局让分
  '268',  // 第{X}局让球
  '306',  // 罚牌全场让球
  '308',  // 上半场罚牌比分
  '324',  // 黄牌让分
  '327',  // 上半场黄牌让分
  '334' // 点球大战-让球
];
// 足球让球玩法
const FOOTBALL_PLAY_LET_BALL = [
  '3', // 全场让球胜平负
  '4', // 全场让球
  '19', // 上半场让球
  '33', // 15分钟进球-让球({a}-{b})
  '69', // 上半场让球胜平负
  '71', // 下半场让球胜平负
  '113',// 角球让球盘
  '121', // 上半场角球让球
  '128', // 加时赛上半场
  '130', // 加时赛-上半场让球
  '143', // 下半场让球
  '232', // 15分钟角球让球
  '269', // 全场让球
  '270', // 半场让球
  '334' // 点球大战-让球
];

// 进球玩法
const PLAY_GOAL = [
  '28', // 第{X}个进球
  '149' // 最后进球队伍
];
//详情部分特殊玩法
const PLAY_RESULT = [
  '3', //全场让球赛果
  '7', //"全场比分"
  '13', // 独赢&进球大小
  '2', //"全场大小",
  '18', //"上半场大小",
  '36', // 任何时间进球球员
  '49', // 第1节净胜分
  '55', // 第2节净胜分
  '61', // 第3节净胜分
  '67', // 第4节净胜分
  '69', //上半场让球赛果
  '71', //下半场让球赛果
  '102', // 进球大小 &两队都进球
  '171', // 独赢&总局数
  '238',  // 点球大战净胜分
  '339',// 独赢 & 准确回合数
  '359',//半场/全场&准确进球数
  '360',//净胜4+
  '141',//净胜4+
  '340',//净胜分
  '383'//下半场净剩分
];
// 各种玩法(不显示盘口的)
const PLAY_ALL_KINDS = [
  '3',  // 全场让球赛果
  '7', //"全场比分"
  '8',  // {主队}准确进球数
  '9',  // {客队}准确进球数
  '20',
  '28', // 第{X}个进球
  '30', // 上半场第{X}个进球
  '49', // 第1节净胜分
  '55', // 第2节净胜分
  '61', // 第3节净胜分
  '67', // 第4节净胜分
  '68', // 总进球数区间
  '69', // 上半场让球赛果
  '71', // 下半场让球赛果
  '108',// 上/下半场两队都进球
  '109',// 上/下半场进球数均大于{X.5}
  '110',// 上/下半场进球数均小于{X.5}
  '141', //"净胜分(不含加时)",
  '340',// 净胜分(不含加时)
  '147',// 第{X}节首先获得{Y}分 三项
  '167',// 第{X}盘第{Y}局和第{Y}+1局谁获胜多
  '168',// 第{X}盘第{Y}局获胜
  '179',// 第{X}局第{Y}分
  '195',// 第{X}局第{Y}个进球的选手
  '196',// 第{X}局打进最后一球的选手
  '200',// 净胜分 三项
  '201',// 首先获得{X}分
  '203',// 第{X}局首先获得{Y}分
  '208',// 第{X}盘是否出现抢七局
  '209',// 净胜分 6项
  '210',// 净胜分 7项
  '211',// 净胜分 12项
  '212',// 净胜分 14项
  '215',// 第{X}节首先获得{Y}分
  '226',// {主队}角球总数区间
  '227',// {客队}角球总数区间
  '228',// 上半场角球总数区间
  '229',// 上半场角球单/双
  '236',// 加时赛-正确比分
  '241',// 点球大战正确比分
  '255',// 第{X}局单/双
  '256',// 第{X}局谁先获得{Y}分
  '260', // 正确比分(不含加时)
  '261', // 第{X}节胜平负
  '267',  // 第{X}局正确比分
  '235', //点球大战-第x个点球
  '133', // 第X个角球
  '225', // 第X张罚牌
  '224', //下张罚牌
  // '341',
  // '342'
  '361',
  '362'
];
// 球员玩法id
const PLAYER_ID = [
  '220', // 球员得分(篮球)
  '221', // 球员三分球(篮球)
  '271', // 球员助攻(篮球)
  '272'  // 球员篮板(篮球)
];
// 所有体育玩法编号列表
const ALL_SPORT_PLAY = {
  1:"全场独赢",
  2:"全场大小",
  3:"全场让球胜平负",
  4:"全场让球",
  5:"平局退款",
  6:"双重机会",
  7:"全场比分",
  8:"{主队}准确进球数",
  9:"{客队}准确进球数",
  10:"{主队}进球大小",
  11:"{客队}进球大小",
  12:"两队都进球",
  13:"独赢 & 进球大小",
  14:"准确进球数",
  15:"进球单/双",
  16:"最多进球的半场",
  17:"半场独赢",
  18:"半场大小",
  19:"半场让球",
  20:"上半场比分",
  21:"上半场{主队}准确进球数",
  22:"上半场{客队}准确进球数",
  23:"上半场准确进球数",
  24:"上半场两队都进球",
  25:"下半场独赢",
  26:"下半场大小",
  27:"剩余时间获胜",
  28:"第{X}个进球",
  29:"上半场剩余时间获胜",
  30:"上半场第{X}个进球",
  31:"第{X}个进球何时发生？",
  32:"15分钟进球-赛果({a}-{b})",
  33:"15分钟进球-让球({a}-{b})",
  34:"15分钟进球-大小({a}-{b})",
  35:"首个进球球员",
  36:"任意时间进球球员",
  37:"全场独赢",
  38:"总分",
  39:"让分",
  40:"总分单/双",
  41:"是否进行加时赛",
  42:"上半场进球单/双",
  43:"上半场平局退款",
  44:"第1节赛果",
  45:"第1节总分",
  46:"第1节让分",
  47:"第1节总分单/双",
  48:"第1节独赢",
  49:"第1节净胜分",
  50:"第2节赛果",
  51:"第2节总分",
  52:"第2节让分",
  53:"第2节总分单/双",
  54:"第2节独赢",
  55:"第2节净胜分",
  56:"第3节赛果",
  57:"第3节总分",
  58:"第3节让分",
  59:"第3节总分单/双",
  60:"第3节独赢",
  61:"第3节净胜分",
  62:"第4节赛果",
  63:"第4节总分",
  64:"第4节让分",
  65:"第4节总分单/双",
  66:"第4节独赢",
  67:"第4节净胜分",
  68:"总进球数区间",
  69:"上半场让球赛果",
  70:"上半场双重机会",
  71:"下半场让球赛果",
  72:"下半场双重机会",
  73:"下半场准确进球数",
  74:"下半场比分",
  75:"下半场进球单/双",
  76:"下半场两队都进球",
  77:"{主队}获胜退款",
  78:"{主队}进球单/双",
  79:"{客队}零失球",
  80:"{客队}零失球获胜",
  81:"{主队}零失球",
  82:"{主队}零失球获胜",
  83:"{主队}上/下半场全胜",
  84:"{主队}任意半场获胜",
  85:"{主队}最高得分半场",
  86:"{主队}上/下半场均进球",
  87:"上半场{主队}进球大小",
  88:"下半场{主队}进球大小",
  89:"下半场{主队}零失球",
  90:"上半场{主队}零失球",
  91:"{客队}获胜退款",
  92:"{客队}进球单/双",
  93:"{客队}上/下半场全胜",
  94:"{客队}任意半场获胜",
  95:"{客队}最高得分半场",
  96:"{客队}上/下半场均进球",
  97:"上半场{客队}进球大小",
  98:"下半场{客队}进球大小",
  99:"下半场{客队}零失球",
  100:"上半场{客队}零失球",
  101:"赛果 & 两队都进球",
  102:"进球大小 & 两队都进球",
  103:"半/全场比分",
  104:"半/全场",
  105:"上半场赛果 & 上半场两队都进球",
  106:"下半场赛果 & 下半场两队都进球",
  107:"双重机会 & 两队都进球",
  108:"上/下半场两队都进球",
  109:"上/下半场进球数均大于{X.5}",
  110:"上/下半场进球数均小于{X.5}",
  111:"哪个球队获得角球多？",
  112:"最后一个角球",
  113:"角球让球盘",
  114:"角球大小盘",
  115:"{主队}角球大小盘",
  116:"{客队}角球大小盘",
  117:"角球总数区间",
  118:"角球单/双",
  119:"上半场哪个球队获得角球多？",
  120:"上半场第{X}个角球",
  121:"上半场角球让球盘",
  122:"上半场角球大小盘",
  123:"上半场{主队}角球大小盘",
  124:"上半场{客队}角球大小盘",
  125:"谁先获得{X}个角球",
  126:"加时赛-赛果",
  127:"加时赛-大小",
  128:"加时赛-让球",
  129:"加时赛-上半场赛果",
  130:"加时赛-上半场让球",
  131:"是否进行点球大战",
  132:"点球大战-获胜者",
  133:"点球大战-第{X}个点球是否射进",
  134:"点球大战-大小盘",
  135:"晋级球队",
  136:"冠军",
  137:"获胜方式",
  138:"比赛中出现红牌",
  139:"{主队}获得红牌",
  140:"{客队}获得红牌",
  141:"净胜分(不含加时)",
  142:"下半场平局退款",
  143:"下半场让球盘",
  144:"谁先开球",
  145:"第{X}节{主队}总分",
  146:"第{X}节{客队}总分",
  147:"第{X}节首先获得{Y}分 三项",
  148:"第{X}个进球队员",
  149:"最后进球队伍",
  150:"最后进球队员",
  151:"进2+球的队员",
  152:"进3+球的队员",
  153:"独赢",
  154:"让盘",
  155:"让局",
  156:"{主队}总局数",
  157:"{客队}总局数",
  158:"出现抢七局",
  159:"准确盘数",
  160:"总局数单/双",
  161:"双重赛果(第1盘/全场获胜)",
  162:"第{X}盘获胜",
  163:"第{X}盘让局",
  164:"第{X}盘总局数",
  165:"第{X}盘总局数单/双",
  166:"第{X}盘正确比分",
  167:"第{X}盘第{Y}局和第{Y}+1局谁获胜多",
  168:"第{X}盘第{Y}局获胜",
  169:"总盘数",
  170:"第{X}盘抢七局正确比分",
  171:"获胜者 & 总局数",
  172:"让分",
  173:"总分",
  174:"准确局数",
  175:"第{X}局获胜",
  176:"第{X}局让分",
  177:"第{X}局总分",
  178:"第{X}局单/双",
  179:"第{X}局第{Y}分",
  180:"比赛进入决胜局",
  181:"让局",
  182:"总局数",
  183:"单双局",
  184:"第{X}局获胜",
  185:"第{X}局让分",
  186:"第{X}局总分",
  187:"第{X}局总分单/双",
  188:"第{X}局首先到达{Y}分",
  189:"第{X}局单杆得分最高的选手",
  190:"第{X}局单杆最高分",
  191:"第{X}局单杆破百",
  192:"第{X}局选手1单杆破百",
  193:"第{X}局选手2单杆破百",
  194:"第{X}局会不会有犯规",
  195:"第{X}局第{Y}个进球的选手",
  196:"第{X}局打进最后一球的选手",
  197:"第{X}局最后得分",
  198:"{主队}总分",
  199:"{客队}总分",
  200:"净胜分 三项",
  201:"首先获得{X}分",
  202:"总局数",
  203:"第{X}局首先获得{Y}分 ",
  204:"全场比分",
  205:"{主队选手}赢得一盘 ",
  206:"{客队选手}赢得一盘 ",
  207:"任何一盘未失一局获胜",
  208:"第{X}盘是否出现抢七局 ",
  209:"净胜分 6项",
  210:"净胜分 7项",
  211:"净胜分 12项",
  212:"净胜分 14项",
  213:"最高得分的小节",
  214:"谁先获得第{X}分(含加时)",
  215:"第{X}节首先获得{Y}分",
  216:"独赢&总分",
  217:"准确总分大小",
  218:"总分区间",
  219:"上半场净胜分",
  220:"球员得分",
  221:"球员三分球",
  222:"第{X}个进球方式",
  223:"谁会进球",
  224:"第{X}张罚牌",
  225:"第{X}个角球",
  226:"{主队}角球总数区间",
  227:"{客队}角球总数区间",
  228:"上半场角球总数区间",
  229:"上半场角球单/双",
  230:"上半场谁先获得{X}个角球",
  231:"15分钟角球-赛果({a}-{b})",
  232:"15分钟角球-让球({a}-{b})",
  233:"15分钟角球-大小({a}-{b})",
  234:"加时赛是否进球",
  235:"加时赛-第{X}个进球",
  236:"加时赛-正确比分",
  237:"点球大战-第{X}个进球",
  238:"点球大战-净胜分",
  239:"点球大战-准确进球数",
  240:"点球大战-单/双",
  241:"点球大战-正确比分",
  242:"独赢",
  243:"让球",
  244:"总分",
  245:"主队得分大小",
  246:"客队得分大小",
  247:"得分单双",
  248:"是否加时",
  249:"前5局让球",
  250:"前5局大小",
  251:"前5局主队得分大小",
  252:"前5局客队得分大小",
  253:"第{X}局让分",
  254:"第{X}局大小",
  255:"第{X}局单双",
  256:"第{X}局谁先获得{Y}分",
  257:"{主队}进球大小(含加时点球大战)",
  258:"{客队}进球大小(含加时点球大战)",
  259:"独赢",
  260:"正确比分",
  261:"第{X}节胜平负",
  262:"第{X}节大小",
  263:"第{X}节{主队}的大小",
  264:"第{X}节{客队}的大小",
  265:"第{X}节准确进球数",
  266:"某{X}节两队都进球",
  267:"第{X}节正确比分",
  268:"第{X}节让球",
  10001:"冠军",
  10002:"垫底",
  10003:"前二",
  10004:"前四",
  10005:"前六",
  10006:"升级",
  10007:"降级",
  10008:"排名上半区",
  10009:"排名下半区",
  10010:"进球最多的球队",
  10011:"进球最少的球队",
  10012:"最佳射手",
  10013:"最有价值球员",
  10014:"决赛对阵球队",
  10015:"下一任总理",
  10016:"下一任总统",
  10017:"获胜党派",
  20001:"全场独赢",
  20004:"全场让球",
  20002:"全场大小",
  200033:"冠军",
  200034:"前二",
  200035:"前三",
}
// 投注数据合并时使用到的玩法id
const BETTING_USED_PLAY = [
  '202', //"总局数",
  '208' //"第{X}盘是否出现抢七局 ",
];

/**
 * 订单取消类型
 */
const CANCEL_TYPE = [
  1, // 比赛取消
  2, // 比赛延期
  3, // 比赛中断
  4, // 比赛重赛
  5, // 比赛腰斩
  6, // 比赛放弃
  17,// 赛事提前
  20 // 比赛延迟
];

// 虚拟体育对象
const VIURTUAL_SPORT = {
  football: '1001', // 虚拟足球
  horse: '1011', // 虚拟赛马
  dog: '1002', // 虚拟赛狗
  basketball: '1004', // 虚拟篮球
  mudland_motorcycle: '1009', // 泥地摩托车
  motorcycle: '1010' // 虚拟摩托车
};

// 虚拟体育赛种id
const VIRTUAL_SPORT_ID = [
  '1001', // 虚拟足球
  '1011',  // 虚拟赛马
  '1002', // 虚拟赛狗
  '1004',  // 虚拟篮球
  '1009', // 泥地摩托车
  '1010'  // 虚拟摩托车
];

//虚拟体育
const VIRTUAL_PLAY_LET_BALL = [
  '20004',
  '20015',
  '20039',
  '20040',
  '20045'
]
const VIRTUAL_PLAY_GOAL = [
  '20001',
  '20013',
  '20043'
]
const VIRTUAL_PLAY_ALL_KINDS = [
  '20002'
]

const VIRTUAL_PLAY_NUMBER = [
  '20033',
  '20034',
  '20035',
  '20036',
  '20037',
  '20038',
  '20041',
  '20042'
];
// 不显示比分的数字
const VIRTUAL_PLAY_NOT_NUMBER = [
  '20036',
  '20037'
];
// 不显示数字样式
const VIRTUAL_PLAY_NOT_NUMBER2 = [
  '20039',
  '20040'
];
// 1、足球 2、篮球 3棒、4冰、5网、 6美足 7斯诺克、8乒乓、9排球、10羽毛球、11手球、12拳击、13沙滩排球
// 修正包含数量的玩法数据合并
const NO_MERAGE_MARKETVALUE = {
  // 1、足球
  "1": [
    "7", // 全场比分
    "8", // {主队}准确进球数
    "9", // {客队}准确进球数
    "13", // 独赢 & 进球大小
    "14", // 准确进球数
    "20", // 上半场比分
    "21", // 上半场{主队}准确进球数
    "22", // 上半场{客队}准确进球数
    "23", // 上半场准确进球数
    "27", // 剩余时间获胜
    "28", // 第1个进球
    "29", // 上半场剩余时间获胜
    "30", // 上半场第1个进球
    "31", // 第{X}个进球何时发生？
    "36", // 任何时间进球队员
    "68", // 总进球区间
    "73", // 下半场准确进球数
    "74", // 下半场比分
    "102", // 进球大小 & 两队都进球
    "103", // 半/全场比分
    "109", // 上/下半场进球数均大于{X}
    "110", // 上/下半场进球数均小于{X}
    "117", // 角球总数区间
    "120", // 上半场第1个角球
    "125", // 谁先获得1个角球
    "133", // 点球大战-第1个点球是否射进
    "141", // 净胜分
    "148", // 第1个进球队员
    "222", // 第1个进球方式
    "224", // 第1张罚牌
    "226", // 主队角球总数区间
    "227", // 客队角球总数区间
    "228", // 上半场角球总数区间
    "230", // 上半场谁先获得1个角球
    "232", // 15分钟角球-让球({X}-{X})
    "235", // 加时赛-第1个进球
    "236", // 加时赛-正确比分
    "237", // 点球大战-第1个进球
    "225", // 第1个角球
    "306", // 罚牌让分
  ],
  // 2、篮球
  "2": [
    "49", // 第一节净胜分
    "55", // 第二节净胜分
    "61", // 第三节净胜分
    "67", // 第四节净胜分
    "141", // 净胜分(不含加时)
    "147", // 第一节首先获得20分(三项)
    "200", // 净胜分
    "201", // 首先获得{X}分
    "209", // 净胜分6项
    "210", // 净胜分7项
    "211", // 净胜分12项
    "212", // 净胜分14项
    "214", // 谁先获得第10分
    "215", // 第一节谁先获得10分
    "218", // 总分区间(不含加时)
    "220", // 球员得分
    "221", // 球员三分球
    "271", // 球员助攻
    "272"  // 球员篮板
  ],
  // 3棒
  "3": [
    "275", // 第{X}局胜平负
    "280", // 第{X}局让球
    "283", // 第{X}局独赢
    "285", // {主队}安打总数
    "286", // {客队}安打总数
    "287", // 第{X}局安打总数
    "288", // 第{X}局{主队}安打总数
    "289", // 第{X}局{客队}安打总数
    "290" // 前5局安打总数
  ],
  // 4冰
  "4": [
    "8", // {主队}准确进球数
    "9", // {客队}准确进球数
    "14", // 准确进球数
    "28", // 第{X}个进球
    "204", // 正确比分
    "261", // 第{X}节胜平负
    "265", // 第{X}节准确进球数
    "266", // 第{X}节两队都进球
    "267", // 第{X}节正确比分
    "268", // 第{X}让球
    "294", // 让球(含加时点球大战)
    "297", // 第{X}节{主队}准确进球数
    "298" // 第{X}节{客队}准确进球数
  ],
  // 5网
  "5": [
    "159", // 准确盘数
    "167", //
    "168", // 第{X}盘第{X}局获胜
    "169", // 总局数
    "171", // 获胜者 & 总局数
    "204", // 全场比分
    "208" // 第x盘是否出现抢七局
  ],
  //  6美足
  "6": [
    "8", // {主队}准确进球数
    "9", // {客队}准确进球数
    "14", // 准确进球数
    "28", // 第{X}个进球
    "149", // 最后一个进球
    "265", // 第{X}节准确进球数
    "305" // 达阵总数
  ],
  // 8乒乓
  "8": [
    "174", // 准确局数
    "204", // 全场比分
    "179",  // 第{X}局第{X}分
    "203",  // 第{X}局首先获得{X}分
  ],
  // 9排球
  "9": [
    "174", // 准确局数
    "204", // 全场比分
    "253", // 第{X}局让分
    "255", // 第{X}局单/双
    "256"  // 第{X}局谁先获得{X}分
  ],
   // 10羽毛球
  "10": [
    "174", // 准确局数
    "179",  // 第{X}局第{X}分
    "203",  // 第{X}局首先获得{X}分
    "204" // 全场比分
  ],
  // 13沙滩排球
  "13": [
    "159", // 准确局数
    "204", // 正确比分
    "253", // 第{X}局让分
    "255", // 第{X}局单/双
    "256"  // 第{X}局谁先获得{X}分
  ]
};
/**顶部菜单菜单到球种的映射 */
const MENU_TO_SPORT = {
  "30001": "0", // 全部
  "30002": "1", // 足球
  "30003": "2", // 篮球
  "30004": "5", // 网球
  "30005": "10",// 羽毛球
  "30006": "8", // 乒乓球
  "30007": "7", // 斯诺克
  "30008": "9", // 排球
  "30009": "4", // 冰球
  "30010": "3", // 棒球
  "30011": "6", // 美式足球
  "30012": "11",// 手球
  "30013": "44",// 拳击
  "30014": "13",// 沙滩排球
  "30016": "16",// 水球
  "30017": "15",// 曲棍球
  "30018": "14",// 橄榄球
}
/**球种的映射到顶部菜单 */
const SPORT_TO_MENU = {
  "0": "30001", // 全部
  "1": "30002", // 足球
  "2": "30003", // 篮球
  "3": "30010", // 棒球
  "4": "30009", // 冰球
  "5": "30004", // 网球
  "6": "30011", // 美式足球
  "7": "30007", // 斯诺克
  "8": "30006", // 乒乓球
  "9": "30008", // 排球
  "10":"30005", // 羽毛球
  "11":"30012", // 手球
  "13":"30014", // 沙滩排球
  "14":"30018", // 橄榄球
  "15":"30017", // 曲棍球
  "16":"30016", // 水球
  "44":"30013", // 拳击
  "100": "30050", // LOL
  "101": "30051", // dota2
  "102": "30052", // CSGO
  "103": "30053" // 王者荣耀
}
// 球种与菜单menuType的映射
const SPORT_TO_MENU_TYPE = {
  "1": "5", // 足球
  "2": "7", // 篮球
  "3": "19", // 棒球
  "4": "18", // 冰球
  "5": "13", // 网球
  "6": "20", // 美式足球
  "7": "14", // 斯诺克
  "8": "16", // 乒乓球
  "9": "17", // 排球
  "10":"15", // 羽毛球
  "11":"43", // 手球
  "12":"44", // 拳击
  "13":"45", // 沙滩排球
  "14":"22", // 橄榄球
  "15":"23", // 曲棍球
  "16":"24" // 水球
}

// 电子竞技
const ESPORTS_SPORT = {
  lol: '100',
  dota2: '101',
  csgo: '102',
  king: '103'
}

const ESPORTS_SPORT_ID = [
  '100', // 英雄联盟
  '101', // dota2
  '102', // CSGO
  '103'  // 王者荣耀
];

//电竞
const ESPORTS_PLAY_LET_BALL = [
  '30001',
  '30002',
  '30003',
  '30006',
  '30007',
  '30008',
  '32001',
  '32004',
  '32006',
  '32007'
];
//滚球下电竞menuIds
export const PLAY_ESPORTS_IDS = [
  "30050", //lol
  "30051", //dota2
  "30052", //csgo
  "30053" //王者
]
//滚球下虚拟体育menuIds
export  const PLAY_VIRTUAL_IDS = [
   '30054', //虚拟足球
   '30056',//虚拟篮球
   '30057', //虚拟赛马
   '30055', //虚拟赛狗
   "30058" //虚拟摩托车
];
// 足球即时比分对应的玩法id
export const FOOTBALL_TIMERLY_SCORE_HPID = [
  1,//全场独赢
  2,//全场大小
  3,//全场让球胜平负
  4,//全场让球
  5,//平局退款
  6,//双重机会
  7,//全场比分
  8,//{主队}准确进球数
  9,//{客队}准确进球数
  10,//{主队}进球大小
  11,//{客队}进球大小
  12,//两队都进球
  13,//独赢 & 进球大小
  14,//准确进球数
  15,//进球单/双
  16,//最多进球的半场
  17,//半场独赢
  18,//半场大小
  19,//半场让球
  20,//上半场比分
  21,//上半场{主队}准确进球数
  22,//上半场{客队}准确进球数
  23,//上半场准确进球数
  24,//上半场两队都进球
  25,//下半场独赢
  26,//下半场大小
  27,//剩余时间获胜
  28,//第{X}个进球
  29,//上半场剩余时间获胜
  30,//上半场第{X}个进球
  31,//第{X}个进球何时发生？
  32,//15分钟进球-独赢({a}-{b})
  33,//15分钟进球-让球({a}-{b})
  34,//15分钟进球-大小({a}-{b})
  35,//首个进球球员
  36,//任意时间进球球员
  42,//上半场进球单/双
  43,//上半场平局退款
  68,//总进球数区间
  69,//上半场让球胜平负
  70,//上半场双重机会
  71,//下半场让球胜平负
  72,//下半场双重机会
  73,//下半场准确进球数
  74,//下半场比分
  75,//下半场进球单/双
  76,//下半场两队都进球
  77,//{主队}获胜退款
  78,//{主队}进球单/双
  79,//{客队}零失球
  80,//{客队}零失球获胜
  81,//{主队}零失球
  82,//{主队}零失球获胜
  83,//{主队}上/下半场全胜
  84,//{主队}任意半场获胜
  85,//{主队}最高得分半场
  86,//{主队}上/下半场均进球
  87,//上半场{主队}进球大小
  88,//下半场{主队}进球大小
  89,//下半场{主队}零失球
  90,//上半场{主队}零失球
  91,//{客队}获胜退款
  92,//{客队}进球单/双
  93,//{客队}上/下半场全胜
  94,//{客队}任意半场获胜
  95,//{客队}最高得分半场
  96,//{客队}上/下半场均进球
  97,//上半场{客队}进球大小
  98,//下半场{客队}进球大小
  99,//下半场{客队}零失球
  100,//上半场{客队}零失球
  101,//独赢 & 两队都进球
  102,//进球大小 & 两队都进球
  103,//半/全场比分
  104,//半/全场
  105,//上半场独赢 & 上半场两队都进球
  106,//下半场独赢 & 下半场两队都进球
  107,//双重机会 & 两队都进球
  108,//上/下半场两队都进球
  109,//上/下半场进球数均大于{X.5}
  110,//上/下半场进球数均小于{X.5}
  111,//角球独赢
  112,//最后一个角球
  113,//角球让球
  114,//角球大小
  115,//{主队}角球大小
  116,//{客队}角球大小
  117,//角球总数区间
  118,//角球单/双
  119,//上半场角球独赢
  120,//上半场第{X}个角球
  121,//上半场角球让球
  122,//上半场角球大小
  123,//上半场{主队}角球大小
  124,//上半场{客队}角球大小
  125,//谁先获得{X}个角球
  126,//加时赛-独赢
  127,//加时赛-大小
  128,//加时赛-让球
  129,//加时赛-上半场独赢
  130,//加时赛-上半场让球
  131,//是否进行点球大战
  132,//点球大战-独赢
  133,//点球大战-第{X}个点球是否射进
  134,//点球大战-大小
  135,//晋级球队
  136,//谁会在决赛中获胜
  137,//获胜方式
  138,//比赛中出现红牌
  139,//{主队}获得红牌
  140,//{客队}获得红牌
  141,//净胜分
  142,//下半场平局退款
  143,//下半场让球
  144,//谁先开球
  148,//第{X}个进球球员
  149,//最后进球队伍
  150,//最后进球球员
  151,//进2+球的球员
  152,//进3+球的球员
  222,//第{X}个进球方式
  223,//谁会进球
  224,//第{X}张罚牌
  225,//第{X}个角球
  226,//{主队}角球总数区间
  227,//{客队}角球总数区间
  228,//上半场角球总数区间
  229,//上半场角球单/双
  230,//上半场谁先获得{X}个角球
  231,//15分钟角球-独赢({a}-{b})
  232,//15分钟角球-让球({a}-{b})
  233,//15分钟角球-大小({a}-{b})
  234,//加时赛是否进球
  235,//加时赛-第{X}个进球
  236,//加时赛-正确比分
  237,//点球大战-第{X}个进球
  238,//点球大战-净胜分
  239,//点球大战-准确进球数
  240,//点球大战-单/双
  241,//点球大战-正确比分
  269,//全场让球
  270,//半场让球
  306,//罚牌让分
  307,//罚牌大小
  308,//上半场罚牌让分
  309,//上半场罚牌大小
  310,//罚牌独赢
  311,//上半场罚牌独赢
  312,//罚牌单/双
  313,//上半场罚牌单/双
  314,//{主队}罚牌大小
  315,//{客队}罚牌大小
  316,//上半场{主队}罚牌大小
  317,//上半场{客队}罚牌大小
  318,//准确罚牌分数
  319,//上半场准确罚牌分数
  320,//{主队}准确罚牌分数
  321,//{客队}准确罚牌分数
  322,//上半场{主队}准确罚牌分数
  323,//上半场{客队}准确罚牌分数
  324,//黄牌让分
  325,//黄牌大小
  326,//黄牌独赢
  327,//上半场黄牌让分
  328,//上半场黄牌大小
  329,//上半场黄牌独赢
  330,//加时赛-单/双
  331,//加时赛-角球大小
  332,//加时赛-上半场大小
  333,//点球大战-前5轮独赢
  334,//点球大战-让球
  335,//点球大战-前5轮大小
  336,//第{X}进球
  367,//全场反波胆
  368,//上半场反波胆
  369,//下半场反波胆
  373,// 上半场{主队}进球单/双
  374,//上半场{客队}进球单/双
  375,//上半场{主队}零失球获胜
  376,// 上半场{客队}零失球获胜
  370, // 15分钟玩法罚牌独赢
  371,// 15分钟玩法罚牌让球
  372, //15分钟玩法罚牌大小
  377,//下半场{主队}进球单/双
  378,//下半场{客队}进球单/双
  381,//下半场{主队}零失球获胜
  382,//下半场{客队}零失球获胜
  10001,//冠军
  10002,//垫底
  10003,//前二
  10004,//前四
  10005,//前六
  10006,//升级
  10007,//降级
  10008,//排名上半区
  10009,//排名下半区
  10010,//进球最多的球队
  10011,//进球最少的球队
  10012 //最佳射手
];
// 篮球即时比分对应的玩法id
export const BASKETBALL_TIMERLY_SCORE_HPID = [
  1, //全场胜平负(不含加时)
  2, //总分(不含加时)
  3, //让分胜平负(不含加时)
  4, //让分(不含加时)
  5, //全场独赢(不含加时)
  10,//{主队}总分(不含加时)
  11,//{客队}总分(不含加时)
  15,//总分单/双(不含加时)
  17,//上半场胜平负
  18,//上半场总分
  19,//上半场让分
  25,//下半场胜平负
  26,//下半场总分
  37,//全场独赢
  38,//总分
  39,//让分
  40,//总分单/双
  41,//是否进行加时赛
  42,//上半场总分单/双
  43,//上半场独赢
  44,//第1节胜平负
  45,//第1节总分
  46,//第1节让分
  47,//第1节总分单/双
  48,//第1节独赢
  49,//第1节净胜分
  50,//第2节胜平负
  51,//第2节总分
  52,//第2节让分
  53,//第2节总分单/双
  54,//第2节独赢
  55,//第2节净胜分
  56,//第3节胜平负
  57,//第3节总分
  58,//第3节让分
  59,//第3节总分单/双
  60,//第3节独赢
  61,//第3节净胜分
  62,//第4节胜平负
  63,//第4节总分
  64,//第4节让分
  65,//第4节总分单/双
  66,//第4节独赢
  67,//第4节净胜分
  75,//半场总分单/双
  87,//上半场{主队}总分
  88,//下半场{主队}总分
  97,//上半场{客队}总分
  98,//下半场{客队}总分
  104,//半/全场(不含加时)
  141,//净胜分(不含加时)
  142,//下半场独赢
  143,//下半场让分
  145,//第{X}节{主队}总分
  146,//第{X}节{客队}总分
  147,//第{X}节首先获得{Y}分(三项)
  198,//{主队}总分
  199,//{客队}总分
  200,//净胜分
  201,//首先获得{Y}分
  209,//净胜分 6项
  210,//净胜分 7项
  211,//净胜分 12项
  212,//净胜分 14项
  213,//最高得分的小节
  214,//谁先获得第{X}分
  215,//第{X}节首先获得{Y}分
  216,//独赢 & 总分
  217,//准确总分大小(不含加时)
  218,//总分区间(不含加时)
  219,//上半场净胜分
  220,//球员得分
  221,//球员三分球
  271,//球员助攻
  272,//球员篮板
  10001,//冠军
  10013,//最有价值球员
  10014 //决赛对阵球队
];
// 棒球及时比分玩法id
export const BASEBALL_TIMERLY_SCORE_HPID = [
  242, // 独赢
  243, // 让球
  244, // 大小
  245, //主队得分大小
  246, //客队得分大小
  247, //得分单/双
  248, //是否进行加时赛
  249, //前5局让球
  250, //前5局大小
  251, //前5局主队得分大小
  252, //前5局客队得分大小
  273, //前5局胜平负
  274, //{a}-{b}局大小
  275, //第{X}局胜平负
  276, //第{X}局大小
  277, //{a}-{b}局胜平负
  278, //{a}-{b}局让球
  279, //{a}-{b}局单双
  280, //第{X}局让球
  281, //第{X}局{主队}大小
  282, //第{X}局{客队}大小
  283, //第{X}局独赢
  284, //安打总数
  285, //{主队}安打总数
  286, //{客队}安打总数
  287, //第{X}局安打总数
  288, //第{X}局{主队}安打总数
  289, //第{X}局{客队}安打总数
  290, //前5局安打总数
  291, //前5局{主队}安打总数
  292  //前5局{客队}安打总数
]
// 乒乓球及时比分玩法id
export const TENNIS_TIMERLY_SCORE_HPID = [
  153, //独赢
  172, //让分
  173, //总分
  174, //准确局数
  175, //第{X}局独赢
  176, //第{X}局让分
  177, //第{X}局总分
  178, //第{X}局单/双
  179, //第{X}局第{Y}分
  203, //第{X}局首先获得{Y}分
  204  //全场比分
];
// 排球及时比分玩法id
export const VOLLEYBALL_TIMERLY_SCORE_HPID = [
  153, //独赢
  159, //准确局数
  204, //正确比分
  162, //第{X}局独赢
  172, //让分
  173, //总分
  253, //第{X}局让分
  254, //第{X}局总分
  255, //第{X}局单/双
  256  //第{X}局谁先获得{Y}分
];
// 球种玩法对应的比分
export const SPORT_PLAY_TO_SCROE = {
  // 足球
  "1": {
    "1":"S1", //全场独赢
    "2":"S1", //全场大小
    "3":"S1", //全场让球胜平负
    "4":"S1", //全场让球
    "5":"S1", //平局退款
    "6":"S1", //双重机会
    "7":"S1", //全场比分
    "8":"S1", //{主队}准确进球数
    "9":"S1", //{客队}准确进球数
    "10":"S1", //{主队}进球大小
    "11":"S1", //{客队}进球大小
    "12":"S1", //两队都进球
    "13":"S1", //独赢 & 进球大小
    "14":"S1", //准确进球数
    "15":"S1", //进球单/双
    "16":"S1", //最多进球的半场
    "17":"S2,S3", //半场独赢
    "18":"S2,S3", //半场大小
    "19":"S2,S3", //半场让球
    "20":"S2", //上半场比分
    "21":"S2", //上半场{主队}准确进球数
    "22":"S2", //上半场{客队}准确进球数
    "23":"S2", //上半场准确进球数
    "24":"S2", //上半场两队都进球
    "25":"S3", //下半场独赢
    "26":"S3", //下半场大小
    "27":"S1", //剩余时间获胜
    "28":"S1", //第{X}个进球
    '336':'S1',//第{X}个进球（无进球退款）
    "29":"S2", //上半场剩余时间获胜
    "30":"S2", //上半场第{X}个进球
    "31":"S1", //第{X}个进球何时发生？
    "32":"S1001,S1002,S1003,S1004,S1005,S1006,S2,S3,S1",	//15分钟进球-独赢({a}-{b})
    "33":"S1001,S1002,S1003,S1004,S1005,S1006,S2,S3,S1",	//15分钟进球-让球({a}-{b})
    "34":"S1001,S1002,S1003,S1004,S1005,S1006,S2,S3,S1",	//15分钟进球-大小({a}-{b})
    "35":"S1", //首个进球球员
    "36":"S1", //任意时间进球球员
    "42":"S2", //上半场进球单/双
    "43":"S2", //上半场平局退款
    "68":"S1", //总进球数区间
    "69":"S2", //上半场让球胜平负
    "70":"S2", //上半场双重机会
    "71":"S3", //下半场让球胜平负
    "72":"S3", //下半场双重机会
    "73":"S3", //下半场准确进球数
    "74":"S3", //下半场比分
    "75":"S3", //下半场进球单/双
    "76":"S3", //下半场两队都进球
    "77":"S1", //{主队}获胜退款
    "78":"S1", //{主队}进球单/双
    "79":"S1", //{客队}零失球
    "80":"S1", //{客队}零失球获胜
    "81":"S1", //{主队}零失球
    "82":"S1", //{主队}零失球获胜
    "83":"S1", //{主队}上/下半场全胜
    "84":"S1", //{主队}任意半场获胜
    "85":"S1", //{主队}最高得分半场
    "86":"S1", //{主队}上/下半场均进球
    "87":"S2", //上半场{主队}进球大小
    "88":"S3", //下半场{主队}进球大小
    "89":"S3", //下半场{主队}零失球
    "90":"S2", //上半场{主队}零失球
    "91":"S1", //{客队}获胜退款
    "92":"S1", //{客队}进球单/双
    "93":"S1", //{客队}上/下半场全胜
    "94":"S1", //{客队}任意半场获胜
    "95":"S1", //{客队}最高得分半场
    "96":"S1", //{客队}上/下半场均进球
    "97":"S2", //上半场{客队}进球大小
    "98":"S3", //下半场{客队}进球大小
    "99":"S3", //下半场{客队}零失球
    "100":"S2", //上半场{客队}零失球
    "101":"S1", //独赢 & 两队都进球
    "102":"S1", //进球大小 & 两队都进球
    "103":"S1", //半/全场比分
    "104":"S1", //半/全场
    "105":"S2", //上半场独赢 & 上半场两队都进球
    "106":"S3", //下半场独赢 & 下半场两队都进球
    "107":"S1", //双重机会 & 两队都进球
    "108":"S1", //上/下半场两队都进球
    "109":"S1", //上/下半场进球数均大于{X.5}
    "110":"S1", //上/下半场进球数均小于{X.5}
    "111":"S555", //角球独赢
    "112":"S555", //最后一个角球
    "113":"S555", //角球让球
    "114":"S555", //角球大小
    "115":"S555", //{主队}角球大小
    "116":"S555", //{客队}角球大小
    "117":"S555", //角球总数区间
    "118":"S555", //角球单/双
    "119":"S15", //上半场角球独赢
    "120":"S15", //上半场第{X}个角球
    "121":"S15", //上半场角球让球
    "122":"S15", //上半场角球大小
    "123":"S15", //上半场{主队}角球大小
    "124":"S15", //上半场{客队}角球大小
    "125":"S555", //谁先获得{X}个角球
    "126":"S7", //加时赛-独赢
    "127":"S7", //加时赛-大小
    "128":"S7", //加时赛-让球
    "129":"S701", //加时赛-上半场独赢
    "130":"S701", //加时赛-上半场让球
    "131":"S1",	//是否进行点球大战
    "132":"S170", //点球大战-独赢
    "133":"S170", //点球大战-第{X}个点球是否射进
    "134":"S170", //点球大战-大小
    "135":"S1", //晋级球队
    "136":"S1", //谁会在决赛中获胜
    "137":"S1", //获胜方式
    "138":"S11", //比赛中出现红牌
    "139":"S11", //{主队}获得红牌
    "140":"S11", //{客队}获得红牌
    "141":"S1", //净胜分
    "142":"S3", //下半场平局退款
    "143":"S3", //下半场让球
    "144":"S1", //谁先开球
    "148":"S1", //第{X}个进球球员
    "149":"S1", //最后进球队伍
    "150":"S1", //最后进球球员
    "151":"S1", //进2+球的球员
    "152":"S1", //进3+球的球员
    "222":"S1", //第{X}个进球方式
    "223":"S1", //谁会进球
    "224":"S10101", //第{X}张罚牌
    "225":"S555", //第{X}个角球
    "226":"S555", //{主队}角球总数区间
    "227":"S555", //{客队}角球总数区间
    "228":"S15", //上半场角球总数区间
    "229":"S15", //上半场角球单/双
    "230":"S15", //上半场谁先获得{X}个角球
    "231":"S5001,S5002,S5003,S5004,S5005,S5006", //15分钟角球-独赢({a}-{b})
    "232":"S5001,S5002,S5003,S5004,S5005,S5006", //15分钟角球-让球({a}-{b})
    "233":"S5001,S5002,S5003,S5004,S5005,S5006", //15分钟角球-大小({a}-{b})
    "234":"S7", //加时赛是否进球
    "235":"S7", //加时赛-第{X}个进球
    "236":"S7", //加时赛-正确比分
    "237":"S170", //点球大战-第{X}个进球
    "238":"S170", //点球大战-净胜分
    "239":"S170", //点球大战-准确进球数
    "240":"S170", //点球大战-单/双
    "241":"S170", //点球大战-正确比分
    "269":"S1", //全场让球
    "270":"S2,S3", //半场让球
    "306":"S10101", //罚牌让分
    "307":"S10101", //罚牌大小
    "308":"S10103", //上半场罚牌让分
    "309":"S10103", //上半场罚牌大小
    "310":"S10101", //罚牌独赢
    "311":"S10103", //上半场罚牌独赢
    "312":"S10101", //罚牌单/双
    "313":"S10103", //上半场罚牌单/双
    "314":"S10101", //{主队}罚牌大小
    "315":"S10101", //{客队}罚牌大小
    "316":"S10103", //上半场{主队}罚牌大小
    "317":"S10103", //上半场{客队}罚牌大小
    "318":"S10101", //准确罚牌分数
    "319":"S10103", //上半场准确罚牌分数
    "320":"S10101", //{主队}准确罚牌分数
    "321":"S10101", //{客队}准确罚牌分数
    "322":"S10103", //上半场{主队}准确罚牌分数
    "323":"S10103", //上半场{客队}准确罚牌分数
    "324":"S12", //黄牌让分
    "325":"S12", //黄牌大小
    "326":"S12", //黄牌独赢
    "327":"S14", //上半场黄牌让分
    "328":"S14", //上半场黄牌大小
    "329":"S14", //上半场黄牌独赢
    "330":"S7", //加时赛-单/双
    "331":"S5", //加时赛-角球大小
    "332":"S701", //加时赛-上半场大小
    "333":"S17005",//点球大战-前5轮独赢
    "334":"S170",//点球大战-让球
    "335":"S17005",//点球大战-前5轮大小
    "367":"S1",//全场反波胆
    "368":"S1",//上半场反波胆
    "369":"S1",//下半场反波胆
    "370":"S5001,S5002,S5003,S5004,S5005,S5006",// 15分钟玩法罚牌独赢
    "371":"S5001,S5002,S5003,S5004,S5005,S5006",// 15分钟玩法罚牌让球
    "372":"S5001,S5002,S5003,S5004,S5005,S5006",//15分钟玩法罚牌大小
    "373":"S1",//上半场{主队}进球单/双
    "374":"S1",//上半场{客队}进球单/双
    "375":"S1",//上半场{主队}零失球获胜
    "376":"S1",//上半场{客队}零失球获胜
    "377":"S1",//下半场{主队}进球单/双
    "378":"S1",//下半场{客队}进球单/双
    "381":"S1",///下半场{主队}零失球获胜
    "382":"S1",//下半场{客队}零失球获胜
    
    
  },
  // 篮球
  "2": {
    "1":"S1", //全场胜平负(不含加时)
    "2":"S1", //总分(不含加时)
    "3":"S1", //让分胜平负(不含加时)
    "4":"S1", //让分(不含加时)
    "5":"S1", //全场独赢(不含加时)
    "10":"S1", //{主队}总分(不含加时)
    "11":"S1", //{客队}总分(不含加时)
    "15":"S1", //总分单/双(不含加时)
    "17":"S2", //上半场胜平负
    "18":"S2", //上半场总分
    "19":"S2", //上半场让分
    "25":"S3", //下半场胜平负
    "26":"S3", //下半场总分
    "37":"S1", //全场独赢
    "38":"S1", //总分
    "39":"S1", //让分
    "40":"S1", //总分单/双
    "41":"S1", //是否进行加时赛
    "42":"S2", //上半场总分单/双
    "43":"S2", //上半场独赢
    "44":"S19", //第1节胜平负
    "45":"S19", //第1节总分
    "46":"S19", //第1节让分
    "47":"S19", //第1节总分单/双
    "48":"S19", //第1节独赢
    "49":"S19", //第1节净胜分
    "50":"S20", //第2节胜平负
    "51":"S20", //第2节总分
    "52":"S20", //第2节让分
    "53":"S20", //第2节总分单/双
    "54":"S20", //第2节独赢
    "55":"S20", //第2节净胜分
    "56":"S21", //第3节胜平负
    "57":"S21", //第3节总分
    "58":"S21", //第3节让分
    "59":"S21", //第3节总分单/双
    "60":"S21", //第3节独赢
    "61":"S21", //第3节净胜分
    "62":"S22", //第4节胜平负
    "63":"S22", //第4节总分
    "64":"S22", //第4节让分
    "65":"S22", //第4节总分单/双
    "66":"S22", //第4节独赢
    "67":"S22", //第4节净胜分
    "75":"S3", //下半场总分单/双
    "87":"S2", //上半场{主队}总分
    "88":"S3", //下半场{主队}总分
    "97":"S2", //上半场{客队}总分
    "98":"S3", //下半场{客队}总分
    "104":"S1", //半/全场(不含加时)
    "141":"S1", //净胜分(不含加时)
    "142":"S3", //下半场独赢
    "143":"S3", //下半场让分
    "145":"S19,S20,S21,S22", //第{X}节{主队}总分
    "146":"S19,S20,S21,S22", //第{X}节{客队}总分
    "147":"S19,S20,S21,S22", //第{X}节首先获得{Y}分(三项)
    "198":"S1", //{主队}总分
    "199":"S1", //{客队}总分
    "200":"S1", //净胜分
    "201":"S1", //首先获得{Y}分
    "209":"S1", //净胜分 6项
    "210":"S1", //净胜分 7项
    "211":"S1", //净胜分 12项
    "212":"S1", //净胜分 14项
    "213":"S1", //最高得分的小节
    "214":"S1", //谁先获得第{X}分
    "215":"S19,S20,S21,S22", //第{X}节首先获得{Y}分
    "216":"S1", //独赢 & 总分
    "217":"S1", //准确总分大小(不含加时)
    "218":"S1", //总分区间(不含加时)
    "220":"S1", //球员得分
    "221":"S1", //球员三分球
    "271":"S1", //球员助攻
    "272":"S1", //球员篮板
  },
  // 棒球
  "3": {
    "242":"S1",
    "243":"S1",
    "244":"S1",
    "245":"S1", // 全场比分
    "246":"S1", // 全场比分
    "247":"S1", // 全场比分
    "248":"S1", // 全场比分
    "249":"S1", // 全场比分
    "250":"S1", // 全场比分
    "251":"S1", // 全场比分
    "252":"S1", // 全场比分
    "273":"S1", // 全场比分
    "274":"S1", // 全场比分
    "275":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "276":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "277":"S1", // 全场比分
    "278":"S1", // 全场比分
    "279":"S1", // 全场比分
    "280":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "281":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "282":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "283":"S120,S121,S122,S123,S124,S125,S126,S127,S128,S129", // 第X局比分
    "284":"S3015", // 安打比分
    "285":"S3015", // 安打比分
    "286":"S3015", // 安打比分
    "287":"S1200,S1220,S1230,S1240,S1250,S1260,S1270,S1280,S1290", // 第X局安打比分
    "288":"S1200,S1220,S1230,S1240,S1250,S1260,S1270,S1280,S1290", // 第X局安打比分
    "289":"S1200,S1220,S1230,S1240,S1250,S1260,S1270,S1280,S1290", // 第X局安打比分
    "284":"S3015",
    "285":"S3015",
    "286":"S3015",
    "290":"S3015",
    "291":"S3015",
    "292":"S3015"
  },
  // 乒乓球
  "8":{
    "153":"S1", //全场比分
    "172":"S1", //全场比分
    "173":"S1", //全场比分
    "174":"S1", //全场比分
    "204":"S1", //全场比分
    "175":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "176":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "177":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "178":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "179":"S120,S121,S122,S123,S124,S125,S126", //第X局的比分
    "203":"S120,S121,S122,S123,S124,S125,S126" //第X局的比分
  },
  //排球
  "9":{
    "153": "S1", // 全场比分
    "159": "S1", // 全场比分
    "204": "S1", // 全场比分
    "172": "S1", // 全场比分
    "173": "S1", // 全场比分
    "162": "S120,S121,S122,S123,S124", // 第X局分
    "253": "S120,S121,S122,S123,S124", // 第X局分
    "254": "S120,S121,S122,S123,S124", // 第X局分
    "255": "S120,S121,S122,S123,S124", // 第X局分
    "256": "S120,S121,S122,S123,S124" // 第X局分
  }
};
// 球种与阶段比分
const SPORT_PLAY_TO_STAGE_SCROE = {
  /**
  足球阶段
  6: 上半场
  7: 下半场
   */
  "1": {
    "17": {
      "6": "S2",
      "7": "S3"
    }, //半场独赢
    "18": {
      "6": "S2",
      "7": "S3"
    }, //半场大小
    "19":{
      "6": "S2",
      "7": "S3"
    }, //半场让球
    "270":{
      "6": "S2",
      "7": "S3"
    }, //半场让球
    "32": {
      "6": "S2",
      "7": "S3",
      "31": "S1"
    },//15分钟  独赢
    "33": {
      "6": "S2",
      "7": "S3",
      "31": "S1"
    },//15分钟 让球
    "34": {
      "6": "S2",
      "7": "S3",
      "31": "S1"
    }//15分钟 大小
  },
  "2": {
    "145":{
      "13": "S19",
      "14": "S20",
      "15": "S21",
      "16": "S22",
      "100": "S22",
      "301": "S20",
      "302": "S21",
      "303": "S22"
    }, //第{X}节{主队}总分
    "146":{
      "13": "S19",
      "14": "S20",
      "15": "S21",
      "16": "S22",
      "100": "S22",
      "301": "S20",
      "302": "S21",
      "303": "S22"
    }, //第{X}节{客队}总分
    "147":{
      "13": "S19",
      "14": "S20",
      "15": "S21",
      "16": "S22",
      "100": "S22",
      "301": "S20",
      "302": "S21",
      "303": "S22"
    }, //第{X}节首先获得{Y}分(三项)
    "215":{
      "13": "S19",
      "14": "S20",
      "15": "S21",
      "16": "S22",
      "100": "S22",
      "301": "S20",
      "302": "S21",
      "303": "S22"
    } //第{X}节首先获得{Y}分
  },
  // 棒球
  "3":{
    "275": {
      "401": "S120",
      "402": "S120",
      "403": "S121",
      "404": "S121",
      "405": "S122",
      "406": "S122",
      "407": "S123",
      "408": "S123",
      "409": "S124",
      "410": "S124",
      "411": "S125",
      "412": "S125",
      "413": "S126",
      "414": "S126",
      "415": "S127",
      "416": "S127",
      "417": "S128",
      "418": "S128",
      "41910": "S129",
      "42010": "S129",
      "421": "S120",
      "422": "S121",
      "423": "S121",
      "424": "S122",
      "425": "S122",
      "426": "S123",
      "427": "S123",
      "428": "S124",
      "429": "S124",
      "430": "S125",
      "431": "S125",
      "432": "S126",
      "433": "S126",
      "434": "S127",
      "435": "S127",
      "436": "S128",
      "437": "S128",
      "43910": "S129"
    },
    "276": {
      "401": "S120",
      "402": "S120",
      "403": "S121",
      "404": "S121",
      "405": "S122",
      "406": "S122",
      "407": "S123",
      "408": "S123",
      "409": "S124",
      "410": "S124",
      "411": "S125",
      "412": "S125",
      "413": "S126",
      "414": "S126",
      "415": "S127",
      "416": "S127",
      "417": "S128",
      "418": "S128",
      "41910": "S129",
      "42010": "S129",
      "421": "S120",
      "422": "S121",
      "423": "S121",
      "424": "S122",
      "425": "S122",
      "426": "S123",
      "427": "S123",
      "428": "S124",
      "429": "S124",
      "430": "S125",
      "431": "S125",
      "432": "S126",
      "433": "S126",
      "434": "S127",
      "435": "S127",
      "436": "S128",
      "437": "S128",
      "43910": "S129"
    },
    "280": {
      "401": "S120",
      "402": "S120",
      "403": "S121",
      "404": "S121",
      "405": "S122",
      "406": "S122",
      "407": "S123",
      "408": "S123",
      "409": "S124",
      "410": "S124",
      "411": "S125",
      "412": "S125",
      "413": "S126",
      "414": "S126",
      "415": "S127",
      "416": "S127",
      "417": "S128",
      "418": "S128",
      "41910": "S129",
      "42010": "S129",
      "421": "S120",
      "422": "S121",
      "423": "S121",
      "424": "S122",
      "425": "S122",
      "426": "S123",
      "427": "S123",
      "428": "S124",
      "429": "S124",
      "430": "S125",
      "431": "S125",
      "432": "S126",
      "433": "S126",
      "434": "S127",
      "435": "S127",
      "436": "S128",
      "437": "S128",
      "43910": "S129"
    },
    "281": {
      "401": "S120",
      "402": "S120",
      "403": "S121",
      "404": "S121",
      "405": "S122",
      "406": "S122",
      "407": "S123",
      "408": "S123",
      "409": "S124",
      "410": "S124",
      "411": "S125",
      "412": "S125",
      "413": "S126",
      "414": "S126",
      "415": "S127",
      "416": "S127",
      "417": "S128",
      "418": "S128",
      "41910": "S129",
      "42010": "S129",
      "421": "S120",
      "422": "S121",
      "423": "S121",
      "424": "S122",
      "425": "S122",
      "426": "S123",
      "427": "S123",
      "428": "S124",
      "429": "S124",
      "430": "S125",
      "431": "S125",
      "432": "S126",
      "433": "S126",
      "434": "S127",
      "435": "S127",
      "436": "S128",
      "437": "S128",
      "43910": "S129"
    },
    "282": {
      "401": "S120",
      "402": "S120",
      "403": "S121",
      "404": "S121",
      "405": "S122",
      "406": "S122",
      "407": "S123",
      "408": "S123",
      "409": "S124",
      "410": "S124",
      "411": "S125",
      "412": "S125",
      "413": "S126",
      "414": "S126",
      "415": "S127",
      "416": "S127",
      "417": "S128",
      "418": "S128",
      "41910": "S129",
      "42010": "S129",
      "421": "S120",
      "422": "S121",
      "423": "S121",
      "424": "S122",
      "425": "S122",
      "426": "S123",
      "427": "S123",
      "428": "S124",
      "429": "S124",
      "430": "S125",
      "431": "S125",
      "432": "S126",
      "433": "S126",
      "434": "S127",
      "435": "S127",
      "436": "S128",
      "437": "S128",
      "43910": "S129"
    },
    "283": {
      "401": "S120",
      "402": "S120",
      "403": "S121",
      "404": "S121",
      "405": "S122",
      "406": "S122",
      "407": "S123",
      "408": "S123",
      "409": "S124",
      "410": "S124",
      "411": "S125",
      "412": "S125",
      "413": "S126",
      "414": "S126",
      "415": "S127",
      "416": "S127",
      "417": "S128",
      "418": "S128",
      "41910": "S129",
      "42010": "S129",
      "421": "S120",
      "422": "S121",
      "423": "S121",
      "424": "S122",
      "425": "S122",
      "426": "S123",
      "427": "S123",
      "428": "S124",
      "429": "S124",
      "430": "S125",
      "431": "S125",
      "432": "S126",
      "433": "S126",
      "434": "S127",
      "435": "S127",
      "436": "S128",
      "437": "S128",
      "43910": "S129"
    },
    "287": {
      "401": "S1200",
      "402": "S1200",
      "403": "S1210",
      "404": "S1210",
      "405": "S1220",
      "406": "S1220",
      "407": "S1230",
      "408": "S1230",
      "409": "S1240",
      "410": "S1240",
      "411": "S1250",
      "412": "S1250",
      "413": "S1260",
      "414": "S1260",
      "415": "S1270",
      "416": "S1270",
      "417": "S1280",
      "418": "S1280",
      "41910": "S1290",
      "42010": "S1290",
      "421": "S1200",
      "422": "S1210",
      "423": "S1210",
      "424": "S1220",
      "425": "S1220",
      "426": "S1230",
      "427": "S1230",
      "428": "S1240",
      "429": "S1240",
      "430": "S1250",
      "431": "S1250",
      "432": "S1260",
      "433": "S1260",
      "434": "S1270",
      "435": "S1270",
      "436": "S1280",
      "437": "S1280",
      "43910": "S1290"
    },
    "288": {
      "401": "S1200",
      "402": "S1200",
      "403": "S1210",
      "404": "S1210",
      "405": "S1220",
      "406": "S1220",
      "407": "S1230",
      "408": "S1230",
      "409": "S1240",
      "410": "S1240",
      "411": "S1250",
      "412": "S1250",
      "413": "S1260",
      "414": "S1260",
      "415": "S1270",
      "416": "S1270",
      "417": "S1280",
      "418": "S1280",
      "41910": "S1290",
      "42010": "S1290",
      "421": "S1200",
      "422": "S1210",
      "423": "S1210",
      "424": "S1220",
      "425": "S1220",
      "426": "S1230",
      "427": "S1230",
      "428": "S1240",
      "429": "S1240",
      "430": "S1250",
      "431": "S1250",
      "432": "S1260",
      "433": "S1260",
      "434": "S1270",
      "435": "S1270",
      "436": "S1280",
      "437": "S1280",
      "43910": "S1290"
    },
    "289": {
      "401": "S1200",
      "402": "S1200",
      "403": "S1210",
      "404": "S1210",
      "405": "S1220",
      "406": "S1220",
      "407": "S1230",
      "408": "S1230",
      "409": "S1240",
      "410": "S1240",
      "411": "S1250",
      "412": "S1250",
      "413": "S1260",
      "414": "S1260",
      "415": "S1270",
      "416": "S1270",
      "417": "S1280",
      "418": "S1280",
      "41910": "S1290",
      "42010": "S1290",
      "421": "S1200",
      "422": "S1210",
      "423": "S1210",
      "424": "S1220",
      "425": "S1220",
      "426": "S1230",
      "427": "S1230",
      "428": "S1240",
      "429": "S1240",
      "430": "S1250",
      "431": "S1250",
      "432": "S1260",
      "433": "S1260",
      "434": "S1270",
      "435": "S1270",
      "436": "S1280",
      "437": "S1280",
      "43910": "S1290"
    }
  },
  // 乒乓球
  "8": {
    "175": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124",
      "305": "S125",
      "306": "S126",
      "441": "S125",
      "442": "S126"
    },
    "176": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124",
      "305": "S125",
      "306": "S126",
      "441": "S125",
      "442": "S126"
    },
    "177": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124",
      "305": "S125",
      "306": "S126",
      "441": "S125",
      "442": "S126"
    },
    "178": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124",
      "305": "S125",
      "306": "S126",
      "441": "S125",
      "442": "S126"
    },
    "179": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124",
      "305": "S125",
      "306": "S126",
      "441": "S125",
      "442": "S126"
    },
    "203": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124",
      "305": "S125",
      "306": "S126",
      "441": "S125",
      "442": "S126"
    },
  },
  // 排球
  "9": {
    "162": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "17": "S124",
      "37": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124"
    },
    "253": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "17": "S124",
      "37": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124"
    },
    "254": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "17": "S124",
      "37": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124"
    },
    "255": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "17": "S124",
      "37": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124"
    },
    "256": {
      "8": "S120",
      "9": "S121",
      "10": "S122",
      "11": "S123",
      "12": "S124",
      "17": "S124",
      "37": "S124",
      "301": "S121",
      "302": "S122",
      "303": "S123",
      "304": "S124"
    }
  }
}
//显示球头值得玩法
const MARKET_FLAG_LIST=[
  '2','3','4','10','11','18','19','26','33','34','71','87','88','97','98','113','114','115',
  '116','121','122','123','124','127','128','130','134','143','232','233','269','270',
  '69','306','307','308','309','314','315','316','317','324','325','327','328','331','332','334','335'
]

//显示球头值得玩法 中的所有让球玩法
const MARKET_RANG_FLAG_LIST=[
  '3', //全场让球胜平负
  '4', //全场让球
  '19', //半场让球
  '33', //15分钟进球-让球({a}-{b})
  '71', //下半场让球胜平负
  '113', //角球让球
  '121', //上半场角球让球
  '128', //加时赛-让球
  '130', //加时赛-上半场让球
  '143', //下半场让球
  '232', //15分钟角球-让球({a}-{b})
  '269', //全场让球
  '270', //半场让球
  '324', //黄牌让分
  '327', //上半场黄牌让分
]
//投注结算后玩法名称无需显示比分
const MARKET_NO_SCORE_LIST=[
  '334',
  '367',//全场反波胆
  '368',//上半场反波胆
  '369',//下半场反波胆
  '373',//
  '374',//
  '375',//
  '376',//
  '377',//
  '378',//
  '381',//
  '382',//
  
]

//要添加球头值下限的大小玩法(全场)
const MARKET_BIG_SMALL_PLAY_LIST = [
  '2', //全场大小
  '18',//半场大小
  '26',//下半场大小
  '34',//15分钟进球-大小({a}-{b})
  '114',//角球大小
  '122',//上半场角球大小
  '127',//加时赛-大小
  '134',//点球大战-大小
  '233',//15分钟角球-大小({a}-{b})
  '307',//罚牌大小
  '309',//上半场罚牌大小
  '325',//黄牌大小
  '328',//上半场黄牌大小
  '331',//加时赛-角球大小
  '332',//加时赛-上半场大小
  '335',//点球大战-前5轮大小
]
//要添加球头值下限的大小玩法(主队)
const MARKET_HOME_PLAY_LIST = [
  '10',//{主队}进球大小
  '87',//上半场{主队}进球大小
  '88',//下半场{主队}进球大小
  '115',//{主队}角球大小
  '123',//上半场{主队}角球大小
  '314',//{主队}罚牌大小
  '316',//上半场{主队}罚牌大小
]
//要添加球头值下限的大小玩法(客队)
const MARKET_AWAY_PLAY_LIST = [
  '11',//{客队}进球大小
  '97',//上半场{客队}进球大小
  '98',//下半场{客队}进球大小
  '116',//{客队}角球大小
  '124',//上半场{客队}角球大小
  '315',//{客队}罚牌大小
  '317',//上半场{客队}罚牌大小
]
//篮球可预约盘口值玩法（总分）
const BASKETBALL_BY_APPOINTMENT_total = [
  '2', //总分(不含加时)
  '10',//{主队}总分(不含加时)
  '11',//{客队}总分(不含加时)
  '18',//上半场总分
  '26',//下半场总分
  '38',//总分
  '45',//第1节总分
  '51',//第2节总分
  '57',//第3节总分
  '63',//第4节总分
  '87',//上半场{主队}总分
  '88',//下半场{主队}总分
  '97',//下半场{主队}总分
  '98',//下半场{客队}总分
  '198',//{主队}总分
  '199',//{客队}总分
  '145',
  '146',
  '220',// 球员得分
  '221',// 球员三分球
  '271',// 球员助攻
  '272',// 球员篮板
]
//篮球可预约盘口值玩法(包含让分和总分)
const BASKETBALL_BY_APPOINTMENT = [
  '2', //总分(不含加时)
  '4', //让分(不含加时)
  '10', //{主队}总分(不含加时)
  '11', //{客队}总分(不含加时)
  '18', //上半场总分
  '19', //上半场让分
  '26',//下半场总分
  '38',//总分
  '39',//让分
  '45',//第1节总分
  '46', //第1节让分
  '51', //第2节总分
  '52', //第2节让分
  '57', //第3节总分
  '58', //第3节让分
  '63', //第4节总分
  '64', //第4节让分
  '87', //上半场{主队}总分
  '88', //下半场{主队}总分
  '97', //上半场{客队}总分
  '98', //下半场{客队}总分
  '143', //下半场让分
  '198', //{主队}总分
  '199', //{客队}总分
  '145',
  '146',
  '220',// 球员得分
  '221',// 球员三分球
  '271',// 球员助攻
  '272',// 球员篮板
]
//篮球可预约盘口值玩法（让分）
const BASKETBALL_BY_APPOINTMENT_let = [
  '4', //让分(不含加时)
  '19', //上半场让分
  '39', //让分
  '46', //第1节让分
  '52', //第2节让分
  '58', //第3节让分
  '64', //第4节让分
  '143', //下半场让分
]

export default {
  BASKETBALL_BY_APPOINTMENT_total,
  BASKETBALL_BY_APPOINTMENT_let,
  BASKETBALL_BY_APPOINTMENT,
  MARKET_RANG_FLAG_LIST,
  MARKET_FLAG_LIST,
  PLAY_TODAY_SCORE,
  SCORE_BASE_KEY,
  PLAY_LET_BALL,
  PLAY_RESULT,
  FOOTBALL_PLAY_LET_BALL,
  PLAY_GOAL,
  PLAYER_ID,
  PLAY_ALL_KINDS,
  BETTING_USED_PLAY,
  CANCEL_TYPE,
  VIURTUAL_SPORT,
  VIRTUAL_SPORT_ID,
  VIRTUAL_PLAY_LET_BALL,
  VIRTUAL_PLAY_GOAL,
  VIRTUAL_PLAY_ALL_KINDS,
  VIRTUAL_PLAY_NUMBER,
  VIRTUAL_PLAY_NOT_NUMBER,
  VIRTUAL_PLAY_NOT_NUMBER2,
  NO_MERAGE_MARKETVALUE,
  MENU_TO_SPORT,
  SPORT_TO_MENU,
  ESPORTS_SPORT,
  ESPORTS_SPORT_ID,
  ESPORTS_PLAY_LET_BALL,
  SPORT_TO_MENU_TYPE,
  PLAY_VIRTUAL_IDS,
  PLAY_ESPORTS_IDS,
  FOOTBALL_TIMERLY_SCORE_HPID,
  BASKETBALL_TIMERLY_SCORE_HPID,
  BASEBALL_TIMERLY_SCORE_HPID,
  TENNIS_TIMERLY_SCORE_HPID,
  VOLLEYBALL_TIMERLY_SCORE_HPID,
  SPORT_PLAY_TO_SCROE,
  SPORT_PLAY_TO_STAGE_SCROE,
  MARKET_BIG_SMALL_PLAY_LIST,
  MARKET_HOME_PLAY_LIST,
  MARKET_AWAY_PLAY_LIST,
  MARKET_NO_SCORE_LIST
}
